In [12]:
from sqlalchemy.engine import create_engine
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
username = "root"
password = quote_plus("908@Ad534")
db_name = "books"
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

In [13]:
engine = create_engine(connection)
conn = engine.connect()

http://localhost:8888/lab/tree/Data/Books.png

In [14]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## AUTHOR DATA

In [15]:
q= '''SELECT * FROM authors'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [author_id, author_name]
Index: []

In [18]:
# Load in Raw Data
authors = pd.read_csv('Data/authors - authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [19]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default           Extra
0    author_id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

In [20]:
describe['Field'].values

array(['author_id', 'author_name'], dtype=object)

In [21]:
authors.columns

Index(['id', 'author_name'], dtype='object')

In [22]:
# Rename columns to match SQL table
rename_map = {"id":"author_id"}
authors = authors.rename(rename_map,axis=1)
authors.head()

   author_id        author_name
0          1       Stephen King
1          2  F.Scott Fitgerald
2          3        Jack London
3          4        Jane Austen
4          5       Mary Shelley

In [23]:
describe[['Field','Type']]

         Field         Type
0    author_id          int
1  author_name  varchar(45)

In [24]:
authors.dtypes

author_id       int64
author_name    object
dtype: object

## DF and SQL columns and datatypes are consistent

In [25]:
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [26]:
# confirm the data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

   author_id        author_name
0          1       Stephen King
1          2  F.Scott Fitgerald
2          3        Jack London
3          4        Jane Austen
4          5       Mary Shelley

In [27]:
# check the describe again to confirm no changes
q = """DESCRIBE authors;"""
pd.read_sql(q,conn)

         Field         Type Null  Key Default           Extra
0    author_id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

## BOOKS DATA

In [28]:
q= '''SELECT * FROM books'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [book_id, title, author_id]
Index: []

In [29]:
# Load in Raw Data
books = pd.read_csv('Data/books - books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [30]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

       Field         Type Null  Key Default           Extra
0    book_id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int   NO  MUL    None

In [31]:
describe['Field'].values

array(['book_id', 'title', 'author_id'], dtype=object)

In [32]:
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [33]:
# Rename columns to match SQL table
rename_map = {"id":"book_id"}
books = books.rename(rename_map,axis=1)
books.head()

   book_id                 title  author_id
0        1           The Shining          1
1        2                    It          1
2        3      The Great Gatsby          2
3        4  The Call of the Wild          3
4        5   Pride and Prejudice          4

In [34]:
describe[['Field','Type']]

       Field         Type
0    book_id          int
1      title  varchar(45)
2  author_id          int

In [35]:
books.dtypes

book_id       int64
title        object
author_id     int64
dtype: object

## DF and SQL columns and datatypes are consistent

In [36]:
books.to_sql("books",conn,index=False, if_exists='append')

6

In [37]:
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

   book_id                 title  author_id
0        1           The Shining          1
1        2                    It          1
2        3      The Great Gatsby          2
3        4  The Call of the Wild          3
4        5   Pride and Prejudice          4
5        6          Frankenstein          5

In [38]:
# check the describe again to confirm no changes
q = """DESCRIBE books;"""
pd.read_sql(q,conn)

       Field         Type Null  Key Default           Extra
0    book_id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int   NO  MUL    None

## USERS DATA

In [39]:
q= '''SELECT * FROM users'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [user_id, first_name, last_name, email]
Index: []

In [44]:
# Load in Raw Data
users = pd.read_csv('Data/users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [45]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default           Extra
0     user_id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [46]:
describe['Field'].values

array(['user_id', 'first_name', 'last_name', 'email'], dtype=object)

In [47]:
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [48]:
# Rename columns to match SQL table
rename_map = {"id":"user_id"}
users = users.rename(rename_map,axis=1)
users.head()

   user_id first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       Robin@books.com
2        3     Gloria  Rodriguez  grodriquez@books.com

In [49]:
describe[['Field','Type']]

        Field         Type
0     user_id          int
1  first_name  varchar(45)
2   last_name  varchar(45)
3       email  varchar(45)

In [50]:
users.dtypes

user_id        int64
first_name    object
last_name     object
email         object
dtype: object

## DF and SQL columns and datatypes are consistent

In [51]:
users.to_sql("users",conn,index=False, if_exists='append')

3

In [52]:
# confirm the data has been added
q = """SELECT * FROM users;"""
pd.read_sql(q,conn)

   user_id first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       Robin@books.com
2        3     Gloria  Rodriguez  grodriquez@books.com

In [53]:
# check the describe again to confirm no changes
q = """DESCRIBE users;"""
pd.read_sql(q,conn)

        Field         Type Null  Key Default           Extra
0     user_id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

## FAVORITES DATA

In [54]:
q= '''SELECT * FROM favorites'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [user_id, book_id]
Index: []

In [55]:
# Load in Raw Data
favorites = pd.read_csv('Data/favorites - favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [56]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

     Field Type Null  Key Default Extra
0  user_id  int   NO  MUL    None
1  book_id  int   NO  MUL    None

In [57]:
describe['Field'].values

array(['user_id', 'book_id'], dtype=object)

In [58]:
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [59]:
describe[['Field','Type']]

     Field Type
0  user_id  int
1  book_id  int

In [60]:
favorites.dtypes

user_id    int64
book_id    int64
dtype: object

## DF and SQL columns and datatypes are consistent

In [61]:
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [62]:
q = """SELECT * FROM favorites;"""
pd.read_sql(q,conn)

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5
5        3        5
6        3        6

In [63]:
q = """DESCRIBE favorites;"""
pd.read_sql(q,conn)

     Field Type Null  Key Default Extra
0  user_id  int   NO  MUL    None
1  book_id  int   NO  MUL    None

## TESTING THE DATABASE

In [64]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [70]:
q = '''SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.book_id = favorites.book_id
WHERE favorites.user_id = 1'''
pd.read_sql(q, conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1